import React from 'react';
import { Box, Typography } from '@mui/material';

export const OfferText: React.FC = () => {
  return (
    <Box>
      <Typography variant="body1" gutterBottom sx={{ color: 'black' }}>
        <Typography
          variant="h4"
          component="h1"
          gutterBottom
          sx={{
            fontWeight: 'bold',
            fontSize: '20px',
            textAlign: 'center',
            marginBottom: '24px',
          }}
        >
          Договор-оферта на оказание услуг по бронированию даты и времени услуги
        </Typography>
        <p>
          Общество с ограниченной ответственностью &laquo;ЭССЕНСРОУЗ&raquo;
          (юридический адрес: 125009, г. Москва, ул. Б. Никитская, д. 21/18,
          стр. 1, эт. 1, пом. I ком 10, ОГРН: 1177746997790,{' '}
          <abbr title="Идентификационный номер налогоплательщика">ИНН</abbr>:
          7731384757), действующее на основании бессрочной лицензии{' '}
          <span style={{ whiteSpace: 'nowrap' }}>Л041-01137-77</span>/00326369
          от <span style={{ whiteSpace: 'nowrap' }}>16.08.2018</span>, выдана:
          Департаментом здравоохранения г. Москвы (юридический адрес: 127006, г.
          Москва, Оружейный переулок, д. 43, стр. 1, телефон:{' '}
          <span style={{ whiteSpace: 'nowrap' }}>8 (495) 777-77-77</span>, эл.
          почта:{' '}
          <a href="mailto:zdrav@mos.ru" style={{ color: 'inherit' }}>
            zdrav@mos.ru
          </a>
          ), в лице генерального директора Миллер Артемия Александровича,
          действующего на основании Устава (далее — Исполнитель), адресует
          настоящий договор-оферта любому физическому лицу (далее — Заказчик),
          выразившему готовность заключить настоящий Договор на следующих
          условиях.
        </p>
        <p>
          В соответствии с пунктом 2 ст. 437 Гражданского кодекса РФ, под
          публичной офертой признается такое предложение, которое содержит все
          существенные условия договора, а также из которого усматривается воля
          лица, делающего предложение, заключить такой договор с любым, кто
          отзовется.
        </p>
        <p>
          Акцептом, <span style={{ whiteSpace: 'nowrap' }}>т. е.</span>{' '}
          принятием условий оферты, признаются действия, связанные с оплатой
          услуги по бронированию времени в целях получения услуги в Обществе с
          ограниченной ответственностью &laquo;ЭССЕНСРОУЗ&raquo; (юридический
          адрес: 125009, г. Москва, ул. Б. Никитская, д. 21/18, стр. 1, эт. 1,
          пом. I ком 10, ОГРН: 1177746997790,{' '}
          <abbr title="Идентификационный номер налогоплательщика">ИНН</abbr>:
          7731384757). Акцепт является полным и безоговорочным. Частичное
          принятие условий невозможно.
        </p>
        <p>
          <strong>1. ПРЕДМЕТ ДОГОВОРА</strong>
          <br />
          1.1. Предметом настоящего договора-оферты выступает оказание услуги
          Исполнителя по бронированию даты и времени оказания услуги в Обществе
          с ограниченной ответственностью &laquo;ЭССЕНСРОУЗ&raquo; (юридический
          адрес: 125009, г. Москва, ул. Б. Никитская, д. 21/18, стр. 1, эт. 1,
          пом. I ком 10, ОГРН: 1177746997790,{' '}
          <abbr title="Идентификационный номер налогоплательщика">ИНН</abbr>:
          7731384757) (далее — услуга бронирования).
        </p>
        <p>
          1.2. Условия настоящего договора-оферты размещаются в любом
          общедоступном месте (в месте оказания услуг Исполнителя, в социальных
          сетях Исполнителя, а также на любых иных ресурсах в сети
          &laquo;Интернет&raquo;).
        </p>
        <p>
          1.2.1. В целях ознакомления с условиями настоящего договора-оферты и
          последующего их акцептирования, Исполнитель вправе направить Заказчику
          настоящий договор-оферту в личные сообщения (мессенджеров/социальных
          сетей).
        </p>
        <p>
          1.3. Условия настоящего договора-оферты считаются принятыми Заказчиком
          в результате совершения одного из следующих действий:
        </p>
        <ul>
          <li>оплатил стоимость услуги бронирования в полном объеме;</li>
          <li>забронировал дату и время оказания услуги у Исполнителя;</li>
          <li>
            иным, незапрещенным законом способом полностью или частично оплатил
            услуги Исполнителя.
          </li>
        </ul>
        <p>
          1.4. Стоимость услуги бронирования составляет 50% от стоимости услуги
          в соответствии с прейскурантом, действующим на момент оплаты указанной
          услуги.
        </p>
        <p>
          1.4.1. По усмотрению Исполнителя стоимость услуги бронирования может
          быть увеличена до 100% от стоимости услуги в соответствии с
          прейскурантом, действующим на момент оплаты указанной услуги.
        </p>
        <p>
          1.5. Услуга бронирования считается оказанной Заказчику в момент
          бронирования даты и времени оказания услуги в Обществе с ограниченной
          ответственностью &laquo;ЭССЕНСРОУЗ&raquo; (юридический адрес: 125009,
          г. Москва, ул. Б. Никитская, д. 21/18, стр. 1, эт. 1, пом. I ком 10,
          ОГРН: 1177746997790, <abbr title="ИНН">ИНН</abbr>: 7731384757).
        </p>
        <p>
          <strong>2. ПОРЯДОК ОКАЗАНИЯ УСЛУГИ</strong>
          <br />
          2.1. Для получения услуги бронирования Заказчику необходимо любым
          удобным способом связаться с Исполнителем и забронировать дату и время
          оказания услуги посредством её согласования с Исполнителем.
        </p>
        <p>
          2.2. Заказчик обязан оплатить стоимость услуги бронирования
          посредством совершения оплаты любым удобным способом по реквизитам
          Исполнителя.
        </p>
        <p>
          2.2.1. Оплата производится Заказчиком в течение 1 (одного) часа с
          момента согласования даты и времени услуги.
        </p>
        <p>
          2.2.2. В случае неоплаты услуги бронирования в течение времени,
          указанного в пункте 2.2.1 настоящего договора, дата и время оказания
          услуги аннулируется.
        </p>
        <p>
          2.3. Заказчик вправе однократно изменить дату и время оказания услуги
          Исполнителя при соблюдении следующих условий:
        </p>
        <p>
          2.3.1. При оказании услуги Исполнителя изменение даты и времени
          возможно не позднее, чем за 24 (двадцать четыре) часа до начала
          забронированной ранее даты и времени оказания услуги Исполнителя.
        </p>
        <p>
          2.4. При несоблюдении условий изменения даты и времени оказания
          услуги, указанных в пункте 2.3.1 Заказчик лишается права на изменение
          даты и времени оказания услуги. Стоимость услуги бронирования по
          настоящему договору пересчету, а равно возврату не подлежит.
        </p>
        <p>
          2.5. В случае явки Заказчика в забронированные дату и время оказания
          услуги итоговая стоимость услуги Исполнителя уменьшается на стоимость
          услуги бронирования.
        </p>
        <p>
          <strong>3. ПРИОСТАНОВЛЕНИЕ И ДОСРОЧНОЕ РАСТОРЖЕНИЕ ДОГОВОРА</strong>
          <br />
          3.1. Договор подлежит досрочному расторжению в одностороннем порядке
          по инициативе Исполнителя в следующих случаях:
        </p>
        <ul>
          <li>Нарушения Заказчиком условий настоящего Договора.</li>
          <li>Нарушения Заказчиком порядка оплаты услуг.</li>
        </ul>
        <p>
          <strong>4. ДОСУДЕБНЫЙ ПОРЯДОК РАССМОТРЕНИЯ СПОРОВ</strong>
          <br />
          4.1. Стороны договорились разрешать все разногласия, связанные с
          оказанием услуг в рамках настоящего договора, путем предъявления
          досудебной претензии.
        </p>
        <p>
          Претензия должна содержать:
          <ul>
            <li>наименование контрагентов (потребитель и исполнитель);</li>
            <li>
              обстоятельства, являющиеся основанием для предъявления претензии
              (вред здоровью, оказание некачественной услуги и т. д.);
            </li>
            <li>
              указание о предполагаемом способе урегулирования претензии
              (исполнение обязательств);
            </li>
            <li>
              расчет суммы требований по претензии и реквизиты счета, на который
              должны быть перечислены денежные средства;
            </li>
            <li>
              срок исполнения обязательств контрагентом и/или срок ответа на
              претензию, который не может превышать 10 дней с даты, когда
              обязательство контрагента должно было быть исполнено, если иной
              срок не предусмотрен договором или законодательством Российской
              Федерации;
            </li>
            <li>
              информацию о мерах, которые будут приняты в случае отклонения
              претензии (приостановка исполнения обязательств потерпевшей
              стороной, обращение в суд);
            </li>
            <li>дату и регистрационный номер претензии;</li>
            <li>подпись Заказчиком (уполномоченного лица);</li>
            <li>перечень прилагаемых документов (при наличии).</li>
          </ul>
        </p>
        <p>
          <strong>5. СРОК ДЕЙСТВИЯ ДОГОВОРА</strong>
          <br />
          5.1. Договор вступает в силу с момента его заключения и действует до
          исполнения сторонами обязательств по Договору.
        </p>
        <p>
          <strong>6. ОСОБЫЕ УСЛОВИЯ ДОГОВОРА</strong>
          <br />
          6.1. Исполнитель оставляет за собой право временно приостанавливать
          работу по техническим или иным причинам. В этом случае, срок действия
          договора продляется на время вынужденного простоя в работе
          Исполнителя.
        </p>
        <p>
          6.2. Принимая условия Договора Заказчик соглашается с тем, что он не
          вправе требовать от Исполнителя какой-либо компенсации морального,
          материального вреда или вреда, причиненного его здоровью как в течение
          срока действия настоящего Договора, так и по истечении срока его
          действия, за исключением случаев, прямо предусмотренных действующим
          законодательством.
        </p>
        <p>
          6.3. Информация считается доведенной до сведения Заказчика, если она
          доступна для ознакомления неограниченному кругу лиц в течение всего
          рабочего дня Исполнителя (сайт Исполнителя, социальные сети
          Исполнителя, место оказания услуг Исполнителя, переписка Исполнителя и
          Заказчика).
        </p>
        <p>
          <strong>7. ОБСТОЯТЕЛЬСТВА НЕПРЕОДОЛИМОЙ СИЛЫ</strong>
          <br />
          7.1. Стороны освобождаются от ответственности за частичное или полное
          неисполнение обязательств по настоящему Договору, если это
          неисполнение явилось следствием обстоятельств непреодолимой силы,
          возникших после заключения настоящего Договора в результате
          обстоятельств чрезвычайного характера, таких как: наводнение, пожар,
          землетрясение и другие природные явления, а также война, военные
          действия, блокада, запретительные действия властей и акты
          государственных органов, разрушение коммуникаций и энергоснабжения,
          взрывы, возникшие во время действия настоящего договора, которые
          стороны не могли предвидеть или предотвратить.
        </p>
        <p>
          7.2. Все споры или разногласия, возникающие между сторонами по
          настоящему Договору или в связи с ним, разрешаются путем переговоров.
        </p>
        <p>
          7.3. В случае исчерпания возможностей для внесудебного урегулирования
          споров стороны вправе обратится в суд за защитой своих интересов.
        </p>
        <p>
          <strong>РЕКВИЗИТЫ</strong>
          <br />
          Исполнитель: <br />
          Общество с ограниченной ответственностью &laquo;ЭССЕНСРОУЗ&raquo;{' '}
          <br />
          юридический адрес: 125009, г. Москва, ул. Б. Никитская, д. 21/18, стр.
          1, эт. 1, пом. I ком 10, <br />
          ОГРН: 1177746997790,{' '}
          <abbr title="Идентификационный номер налогоплательщика">ИНН</abbr>:
          7731384757,
          <br />
          действующее на основании бессрочной лицензии{' '}
          <span style={{ whiteSpace: 'nowrap' }}>Л041-01137-77</span>/00326369
          от <span style={{ whiteSpace: 'nowrap' }}>16.08.2018</span>, выдана:
          Департаментом здравоохранения г. Москвы (юридический адрес: 127006, г.
          Москва, Оружейный переулок, д. 43, стр. 1, телефон:{' '}
          <span style={{ whiteSpace: 'nowrap' }}>8 (495) 777-77-77</span>, эл.
          почта:{' '}
          <a href="mailto:zdrav@mos.ru" style={{ color: 'inherit' }}>
            zdrav@mos.ru
          </a>
          )
          <br />
          Банковские реквизиты:
          <br />
          р\с 40702810202370003721 <br />
          к\с 30101810200000000593 <br />
          БИК 044525593 <br />
          <span style={{ whiteSpace: 'nowrap' }}>
            АО &laquo;АЛЬФА-БАНК&raquo; Г. МОСКВА
          </span>
          <br />
          Адрес электронной почты:{' '}
          <a href="mailto:essencerose@mail.ru" style={{ color: 'inherit' }}>
            essencerose@mail.ru
          </a>
          <br />
          Адрес сайта:{' '}
          <a href="https://missis-laser.ru/" style={{ color: 'inherit' }}>
            https://missis-laser.ru/
          </a>
          <br />
          Телефон: +7 (800) 551 52 57 <br />
          Генеральный директор <br />
          __________________/
          <span style={{ whiteSpace: 'nowrap' }}>А. А. Миллер</span>
        </p>
      </Typography>
    </Box>
  );
};
