import React from 'react';
import { Box, Typography } from '@mui/material';

export const OfferTextMissis: React.FC = () => {
  return (
    <Box>
      <Typography variant="body1" gutterBottom sx={{ color: 'black' }}>
        <Typography
          variant="h4"
          component="h1"
          gutterBottom
          sx={{
            fontWeight: 'bold',
            fontSize: '20px',
            textAlign: 'center',
            marginBottom: '24px',
          }}
        >
          Договор-оферта на оказание услуг по бронированию даты и времени услуги
        </Typography>

        <section>
          <p>
            Общество с ограниченной ответственностью «МИССИС ЛЭ» (юридический адрес: 127051, г. Москва, ул. Петровка, д. 26, стр. 3, эт. 2, пом.4, ОГРН: 1207700193678, ИНН: 9704018410, действующее на основании бессрочной лицензии: Л041-01137-77/00327724 от 29.12.2020, выданной Департаментом здравоохранения города Москвы (юридический адрес: 109012, Москва, Славянская площадь, д.4, стр.1, телефон: +7 (499) 578-02-20, эл. почта: <a href="mailto:info@roszdravnadzor.gov.ru">info@roszdravnadzor.gov.ru</a>), в лице генерального директора Батюта Елизавета Сергеевна, действующего на основании Устава (далее – Исполнитель), адресует настоящий договор-оферта (далее по тексту – Договор) любому физическому лицу (далее – Заказчик), выразившему готовность заключить настоящий Договор на следующих условиях.
          </p>
          <p>
            В соответствии с пунктом 2 ст. 437 Гражданского кодекса РФ, под публичной офертой признается такое предложение, которое содержит все существенные условия договора, а также из которого усматривается воля лица, делающего предложение, заключить такой договор на тех условиях, что приведены в предложении с любым, кто отзовется.
          </p>

          <p>
            Акцептом, т.е. принятием условий оферты, признаются действия, связанные с оплатой услуги по бронированию времени в целях получения услуги в Обществе с ограниченной ответственностью «МИССИС ЛЭ» (юридический адрес: 127051, г. Москва, ул. Петровка, д. 26, стр. 3, эт. 2, пом.4, ОГРН: 1207700193678, ИНН: 9704018410). Акцепт является полным и безоговорочным. Частичное принятие условий невозможно.
          </p>

          <strong>1. ПРЕДМЕТ ДОГОВОРА</strong>
          <p>
            1.1. Предметом настоящего договора-оферты является оказание услуги Исполнителя по бронированию даты и
            времени оказания услуги в Обществе с ограниченной ответственностью «МИССИС ЛЭ»
            (юридический адрес: 127051, г. Москва, ул. Петровка, д. 26, стр. 3, эт. 2, пом.4, ОГРН: 1207700193678,
            ИНН: 9704018410) (далее – услуга бронирования).
          </p>

          <p>
            1.2. Условия настоящего договора-оферты размещаются в любом общедоступном месте (в месте оказания услуг
            Исполнителя, в социальных сетях Исполнителя, а также на любых иных ресурсах в сети «Интернет»).
          </p>

          <p>
            1.2.1. В целях ознакомления с условиями настоящего договора-оферты и последующего их акцептирования,
            Исполнитель вправе направить Заказчику настоящий договор-оферту в личные сообщения (мессенджеров/социальных сетей).
          </p>

          <p>
            1.3. Условия настоящего договора-оферты считаются принятыми Заказчиком в результате совершения одного из
            следующих действий:
            <ul>
              <li>оплатил стоимость услуги бронирования в полном объеме;</li>
              <li>забронировал дату и время оказания услуги у Исполнителя;</li>
              <li>иным, незапрещенным законом способом полностью или частично оплатил услуги Исполнителя.</li>
            </ul>
          </p>

          <p>
            1.4. Стоимость услуги бронирования составляет 50% от стоимости услуги в соответствии с прейскурантом,
            действующим на момент оплаты указанной услуги.
          </p>

          <p>
            1.4.1. По усмотрению Исполнителя стоимость услуги бронирования может быть увеличена до 100% от стоимости
            услуги в соответствии с прейскурантом, действующим на момент оплаты указанной услуги.
          </p>

          <p>
            1.5. Услуга бронирования считается оказанной Заказчику в момент бронирования даты и времени оказания услуги
            в Обществе с ограниченной ответственностью «МИССИС ЛЭ»
            (юридический адрес: 127051, г. Москва, ул. Петровка, д. 26, стр. 3, эт. 2, пом.4, ОГРН: 1207700193678,
            ИНН: 9704018410).
          </p>
        </section>
        <section>
          <strong>2. ПОРЯДОК ОКАЗАНИЯ УСЛУГИ</strong>
          <p>
            2.1. Для получения Услуги бронирования Заказчику необходимо любым удобным способом связаться с Исполнителем и забронировать дату и время оказания услуги посредством ее согласования с Исполнителем.
          </p>
          <p>
            2.2. Заказчик обязан оплатить стоимость услуги бронирования посредством совершения оплаты любым удобным способом по реквизитам Заказчика.
          </p>
          <p>
            2.2.1. Оплата производится Заказчиком в течение 1 (одного) часа с момента согласования даты и времени услуги.
          </p>
          <p>
            2.2.2. В случае неоплаты услуги бронирования в течение времени, указанного в пункте 2.2.1 настоящего договора, дата и время оказания услуги аннулируется.
          </p>
          <p>
            2.3. Заказчик вправе однократно изменить дату и время оказания услуги Исполнителя при соблюдении следующих условий:
          </p>
          <ul>
            <li>2.3.1. при оказании услуги Исполнителя изменение даты и времени возможно не позднее, чем за 24 (двадцать четыре) часа до начала забронированной ранее даты и времени оказания услуги Исполнителя.</li>
          </ul>
          <p>
            2.4. При несоблюдении условий изменения даты и времени оказания услуги Исполнителя, указанных в пункте 2.3.1, Заказчик лишается права на изменение даты и времени оказания услуги Исполнителя. Стоимость услуги бронирования по настоящему договору пересчету, а равно возврату не подлежит.
          </p>
          <p>
            2.5. В случае явки Заказчика в забронированные дату и время оказания услуги Исполнителя итоговая стоимость услуги Исполнителя уменьшается на стоимость услуги бронирования.
          </p>
        </section>
        <section>
          <strong>3. ПРИОСТАНОВЛЕНИЕ И ДОСРОЧНОЕ РАСТОРЖЕНИЕ ДОГОВОРА</strong>
          <p>
            3.1. Договор подлежит досрочному расторжению в одностороннем порядке по инициативе Исполнителя в следующих случаях:
          </p>
          <ul>
            <li>3.1.1. Нарушение Заказчиком условий настоящего Договора.</li>
            <li>3.1.2. Нарушение Заказчиком порядка оплаты услуг.</li>
          </ul>
        </section>
        <section>
        <strong>4. ДОСУДЕБНЫЙ ПОРЯДОК РАССМОТРЕНИЯ СПОРОВ</strong>
          <p>4.1. Стороны договорились разрешать все разногласия, связанные с оказанием услуг в рамках настоящего договора, путем предъявления досудебной претензии.</p>
          <p>4.2. Претензия должна содержать:</p>
          <ul>
            <li>наименование контрагентов (потребитель и исполнитель);</li>
            <li>обстоятельства, являющиеся основанием для предъявления претензии (вред здоровью, оказание некачественной услуги и т.д.);</li>
            <li>указание о предполагаемом способе урегулирования претензии (исполнения обязательств);</li>
            <li>расчет суммы требований по претензии и реквизиты счета, на который должны быть перечислены денежные средства;</li>
            <li>срок исполнения обязательств контрагентом и/или срок ответа на претензию, который не может превышать 10 дней с даты, когда обязательство контрагента должно было быть исполнено, если иной срок не предусмотрен договором или законодательством Российской Федерации;</li>
            <li>информацию о мерах, которые будут приняты в случае отклонения претензии (приостановка исполнения обязательств потерпевшей стороной, обращение в суд);</li>
            <li>дату и регистрационный номер претензии;</li>
            <li>подпись Заказчика (уполномоченного лица);</li>
            <li>перечень прилагаемых документов (при наличии).</li>
          </ul>
          <p>
            Претензионный порядок включает:
          </p>
          <ul>
            <li>вручение или направление потерпевшей стороной письменной претензии заинтересованной стороне почтой (факсом, электронной почтой) с подтверждением получения;</li>
            <li>рассмотрение претензии и подтверждающих материалов заинтересованной стороной в течение 10 дней с момента получения претензии;</li>
            <li>письменное уведомление заявителя об удовлетворении претензии или мотивированный отказ заявителю в письменной форме на претензию заинтересованной стороной;</li>
            <li>представленные вместе с претензией документы возвращаются заявителю.</li>
          </ul>
        </section>
        <section>
        <strong>5. СРОК ДЕЙСТВИЯ ДОГОВОРА</strong>
          <p>
            5.1. Договор вступает в силу с момента его заключения и действует до исполнения сторонами обязательств по Договору.
          </p>
        </section>
        <section>
          <strong>6. ОСОБЫЕ УСЛОВИЯ ДОГОВОРА</strong>
          <p>
            6.1. Исполнитель оставляет за собой право временно приостанавливать работу по техническим или иным причинам. В этом случае, срок действия договора продляется на время вынужденного простоя в работе Исполнителя.
          </p>
          <p>
            6.2. Принимая условия Договора, Заказчик соглашается с тем, что он не вправе требовать от Исполнителя какой-либо компенсации морального, материального вреда или вреда, причиненного его здоровью как в течение срока действия настоящего Договора, так и по истечении срока его действия, за исключением случаев, прямо предусмотренных действующим законодательством.
          </p>
          <p>
            6.3. Информация считается доведенной до сведения Заказчика, если она доступна для ознакомления неограниченному кругу лиц в течение всего рабочего дня Исполнителя (сайт Исполнителя, социальные сети Исполнителя, место оказания услуг Исполнителя, переписка Исполнителя и Заказчика).
          </p>
          <p>
            6.4. Все отношения, не урегулированные сторонами в настоящем договоре, регламентируются действующим законодательством Российской Федерации. В случае не достижения сторонами согласия спор будет передан на рассмотрение в суд общей юрисдикции по подсудности.
          </p>
        </section>
        <section>
        <strong>7. ОБСТОЯТЕЛЬСТВА НЕПРЕОДОЛИМОЙ СИЛЫ</strong>
          <p>
            7.1. Стороны освобождаются от ответственности за частичное или полное неисполнение обязательств по настоящему Договору, если это неисполнение явилось следствием обстоятельств непреодолимой силы, возникших после заключения настоящего Договора в результате обстоятельств чрезвычайного характера, таких как: наводнение, пожар, землетрясение и другие природные явления, а также война, военные действия, блокада, запретительные действия властей и акты государственных органов, разрушение коммуникаций и энергоснабжения, взрывы, возникшие во время действия настоящего договора, которые стороны не могли предвидеть или предотвратить.
          </p>
          <p>
            7.2. Все споры или разногласия, возникающие между сторонами по настоящему Договору или в связи с ним, разрешаются путем переговоров.
          </p>
          <p>
            7.3. В случае исчерпания возможностей для внесудебного урегулирования споров стороны вправе обратиться в суд за защитой своих интересов.
          </p>
        </section>

        <section>
        <strong>РЕКВИЗИТЫ</strong>
          <p><strong>ИСПОЛНИТЕЛЬ:</strong></p>
          <p>
            Общество с ограниченной ответственностью «МИССИС ЛЭ»<br />
            юридический адрес: 127051, г. Москва, ул. Петровка, д. 26, стр. 3, эт. 2, пом.4<br />
            ОГРН: 1207700193678, ИНН: 9704018410<br />
            действующее на основании бессрочной лицензии Л041-01137-77/00327724 от 29.12.2020, выдана: Департамент здравоохранения города Москвы (юридический адрес: 109012, Москва, Славянская площадь, д.4, стр.1, телефон +7 (499) 578-02-20, эл. почта: info@roszdravnadzor.gov.ru)
          </p>
          <p><strong>Банковские реквизиты:</strong></p>
          <p>
            р\с: 40702810338000453711<br />
            к\с: 30101810400000000225<br />
            БИК: 044525225<br />
            ПАО Сбербанк, г. Москва
          </p>
          <p>
            Адрес электронной почты: <a href="mailto:missislemsk@mail.ru">missislemsk@mail.ru</a><br />
            Адрес сайта: <a href="https://missis-laser.ru/">https://missis-laser.ru/</a><br />
            Телефон: <a href="tel:+78005515257">+7 (800) 551 52 57</a>
          </p>
          <p><strong>Генеральный директор</strong></p>
          <p>__________________/ Батюта Елизавета Сергеевна</p>
        </section>

      </Typography>
    </Box>
  );
};
