import React from 'react';
import { Box, Typography } from '@mui/material';

export const OfferTextMissis: React.FC = () => {
  return (
    <Box>
      <Typography variant="body1" gutterBottom sx={{ color: 'black' }}>
        <Typography
          variant="h4"
          component="h1"
          gutterBottom
          sx={{
            fontWeight: 'bold',
            fontSize: '20px',
            textAlign: 'center',
            marginBottom: '24px',
          }}
        >
          Договор-оферта на оказание услуг по бронированию даты и времени услуги
        </Typography>

        <div>
          <p>Общество с&nbsp;ограниченной ответственностью &laquo;МИССИС ЛЭ&raquo; (юридический адрес: 127051, г.&nbsp;Москва, ул.&nbsp;Петровка, д. 26, стр.&nbsp;3, эт. 2, пом.4, ОГРН: 1207700193678, <abbr title="Идентификационный номер налогоплательщика" lang="ru">ИНН</abbr>: 9704018410, действующее на&nbsp;основании бессрочной лицензии: <span>Л041-01137-77</span>/00327724; от&nbsp;<span>29.12.2020</span>, выдана: Департамент здравоохранения города Москвы (юридический адрес: 109012, Москва, Славянская площадь, д.4, стр.&nbsp;1, телефон +74995780220, эл. почта: <a href="mailto:info@roszdravnadzor.gov.ru">info@roszdravnadzor.gov.ru</a>), в&nbsp;лице генерального директора Батюта Елизавета Сергеевна, действующего на&nbsp;основании Устава (далее&nbsp;&mdash; Исполнитель), адресует настоящий <span>договор-оферта</span> (далее по&nbsp;тексту&nbsp;&mdash; Договор) любому физическому лицу (далее&nbsp;&mdash; Заказчик), выразившему готовность заключить настоящий Договор на&nbsp;следующих условиях.</p>
          <p>В&nbsp;соответствии с&nbsp;пунктом 2 ст. 437 Гражданского кодекса РФ, под публичной офертой признается такое предложение, которое содержит все существенные условия договора, а&nbsp;также из&nbsp;которого усматривается воля лица, делающего предложение, заключить такой договора на&nbsp;тех условиях, что приведены в&nbsp;предложении с&nbsp;любым, кто отзовется.</p>
          <p>Акцептом, <span>т. е.</span> принятие условий оферты, признаются действия, связанные с&nbsp;оплатой услуги по&nbsp;бронированию времени в&nbsp;целях получения услуги в&nbsp;Обществе с&nbsp;ограниченной ответственностью &laquo;МИССИС ЛЭ&raquo; (юридический адрес: 127051, г.&nbsp;Москва, ул.&nbsp;Петровка, д. 26, стр.&nbsp;3, эт. 2, пом.4, ОГРН: 1207700193678, <abbr title="Идентификационный номер налогоплательщика" lang="ru">ИНН</abbr>: 9704018410). Акцепт является полным и&nbsp;безоговорочным. Частичное принятие условие невозможно.</p>
          <p>1. ПРЕДМЕТ ДОГОВОРА</p>
          <p>1.1. Предметом настоящего <span>договора-оферты</span> выступает оказание услуги Исполнителя по&nbsp;бронированию даты и&nbsp;времени оказания услуги в&nbsp;Обществе с&nbsp;ограниченной ответственностью &laquo;МИССИС ЛЭ&raquo; (юридический адрес: 127051, г.&nbsp;Москва, ул.&nbsp;Петровка, д. 26, стр.&nbsp;3, эт. 2, пом.4, ОГРН: 1207700193678, <abbr title="Идентификационный номер налогоплательщика" lang="ru">ИНН</abbr>: 9704018410) (далее&nbsp;&mdash; услуга бронирования).<br />
            1.2. Условия настоящего <span>договора-оферты</span> размещаются в&nbsp;любом общедоступном месте (в&nbsp;месте оказания услуг Исполнителя, в&nbsp;социальных сетях Исполнителя, а&nbsp;также на&nbsp;любых иных ресурсах в&nbsp;сети &laquo;Интернет&raquo;).<br />
            1.2.1. В&nbsp;целях ознакомления с&nbsp;условиями настоящего <span>договора-оферты</span> и&nbsp;последующего их&nbsp;акцентирования, Исполнитель вправе направить Заказчику настоящий <span>договор-оферту</span> в&nbsp;личные сообщения (мессенджеров/социальных сетей).<br />
            1.3. Условия настоящего <span>договора-оферты</span> считаются принятыми Заказчиком в&nbsp;результате совершения одного из&nbsp;следующих действий:<br />
            &mdash;&nbsp;оплатил стоимость услуги бронирования в&nbsp;полном объеме;<br />
            &mdash;&nbsp;забронировал дату и&nbsp;время оказания услуги у&nbsp;Исполнителя;<br />
            &mdash;&nbsp;иным, незапрещенным законом способом полностью или частично оплатил услуги Исполнителя.<br />
            1.4. Стоимость услуги бронирования составляет 50% от&nbsp;стоимости услуги соответствии с&nbsp;прейскурантом, действующим на&nbsp;момент оплаты указанной услуги.<br />
            1.4.1. По&nbsp;усмотрению Исполнителя стоимость услуги бронирования может быть увеличена до&nbsp;100% от&nbsp;стоимости услуги соответствии с&nbsp;прейскурантом, действующим на&nbsp;момент оплаты указанной услуги.<br />
            1.5. Услуга бронирования считается оказанной Заказчику в&nbsp;момент бронирования даты и&nbsp;времени оказания услуги в&nbsp;Обществе с&nbsp;ограниченной ответственностью &laquo;МИССИС ЛЭ&raquo; (юридический адрес: 127051, г.&nbsp;Москва, ул.&nbsp;Петровка, д. 26, стр.&nbsp;3, эт. 2, пом.4, ОГРН: 1207700193678, <abbr title="Идентификационный номер налогоплательщика" lang="ru">ИНН</abbr>: 9704018410).</p>
          <p>2. ПОРЯДОК ОКАЗАНИЯ УСЛУГИ</p>
          <p>2.1. Для получения Услуги бронирования Заказчику необходимо любым удобным способом связаться с&nbsp;Исполнителем и&nbsp;забронировать дату и&nbsp;время оказания услуги посредством ее&nbsp;согласования с&nbsp;Исполнителем.<br />
            2.2. Заказчик обязан оплатить стоимость услуги бронирования посредством совершения оплаты любым удобным способом по&nbsp;реквизитам Заказчика.<br />
            2.2.1. Оплата производится Заказчиком в&nbsp;течение 1 (одного) часа с&nbsp;момента согласования даты и&nbsp;времени услуги.<br />
            2.2.2. В&nbsp;случае неоплаты услуги бронирования в&nbsp;течение времени, указанного в&nbsp;пункте 2.2.1 настоящего договора, дата и&nbsp;время оказания услуги аннулируется.<br />
            2.3. Заказчик вправе однократно изменить дату и&nbsp;время оказания услуги Исполнителя при соблюдении следующих условий:<br />
            2.3.1. при оказании услуги Исполнителя изменение даты и&nbsp;времени возможно не&nbsp;позднее, чем за&nbsp;24 (двадцать четыре) часа до&nbsp;начала забронированной ранее даты и&nbsp;времени оказания услуги Исполнителя.<br />
            2.4. При не&nbsp;соблюдении условий изменения даты и&nbsp;времени оказания услуги Исполнителя, указанных в&nbsp;пункте 2.3.1 Заказчик лишается права на&nbsp;изменение даты и&nbsp;времени оказания услуги Исполнителя. Стоимость услуги бронирования по&nbsp;настоящему договору пересчету, а&nbsp;равно возврату не&nbsp;подлежит.<br />
            2.5. В&nbsp;случае явки Заказчика в&nbsp;забронированные дату и&nbsp;время оказания услуги Исполнителя итоговая стоимость услуги Исполнителя уменьшается на&nbsp;стоимость услуги бронирования.</p>
          <p>3. ПРИОСТАНОВЛЕНИЕ И&nbsp;ДОСРОЧНОЕ РАСТОРЖЕНИЕ ДОГОВОРА</p>
          <p>3.1. Договор подлежит досрочному расторжению в&nbsp;одностороннем порядке по&nbsp;инициативе Исполнителя в&nbsp;следующих случаях:<br />
            3.1.1. Нарушения Заказчиком условий настоящего Договора.<br />
            3.1.2. Нарушения Заказчиком порядка оплаты услуг.</p>
          <p>4. ДОСУДЕБНЫЙ ПОРЯДОК РАССМОТРЕНИЯ СПОРОВ</p>
          <p>4.1. Стороны договорились разрешать все разногласия, связанные с&nbsp;оказанием услуг в&nbsp;рамках настоящего договора, путем предъявления досудебной претензии.<br />
            4.2. Претензия должна содержать:<br />
            &mdash;&nbsp;наименование контрагентов (потребитель и&nbsp;исполнитель);<br />
            &mdash;&nbsp;обстоятельства, являющиеся основанием для предъявления претензии (вред здоровью, оказание некачественной услуги <span>и т. д.</span>);<br />
            &mdash;&nbsp;указание о&nbsp;предполагаемом способе урегулирования претензии (исполнения обязательств);<br />
            &mdash;&nbsp;расчет суммы требований по&nbsp;претензии и&nbsp;реквизиты счета, на&nbsp;который должны быть перечислены денежные средства;<br />
            &mdash;&nbsp;срок исполнения обязательств контрагентом и/или срок ответа на&nbsp;претензию, который не&nbsp;может превышать 10 дней с&nbsp;даты, когда обязательство контрагента должно было быть исполнено, если иной срок не&nbsp;предусмотрен договором или законодательством Российской Федерации;<br />
            &mdash;&nbsp;информацию о&nbsp;мерах, которые будут приняты в&nbsp;случае отклонения претензии (приостановка исполнения обязательств потерпевшей стороной, обращение в&nbsp;суд);<br />
            &mdash;&nbsp;дату и&nbsp;регистрационный номер претензии;<br />
            &mdash;&nbsp;подпись Заказчиком (уполномоченного лица);<br />
            &mdash;&nbsp;перечень прилагаемых документов (при наличии).<br />
            Претензионный порядок включает:<br />
            &mdash;&nbsp;вручение или направление потерпевшей стороной письменной претензии заинтересованной стороне почтой (факсом, электронной почтой) с&nbsp;подтверждением получения;<br />
            &mdash;&nbsp;рассмотрение претензии и&nbsp;подтверждающих материалов заинтересованной стороной в&nbsp;течение 10 дней с&nbsp;момента получения претензии;<br />
            &mdash;&nbsp;письменное уведомление заявителя об&nbsp;удовлетворении претензии или мотивированный отказ заявителю в&nbsp;письменной форме на&nbsp;претензию заинтересованной стороной;<br />
            &mdash;&nbsp;представленные вместе с&nbsp;претензией документы возвращаются заявителю;</p>
          <p>5. СРОК ДЕЙСТВИЯ ДОГОВОРА</p>
          <p>5.1. Договор вступает в&nbsp;силу с&nbsp;момента его заключения и&nbsp;действует до&nbsp;исполнения сторонами обязательств по&nbsp;Договору.</p>
          <p>6. ОСОБЫЕ УСЛОВИЯ ДОГОВОРА</p>
          <p>6.1. Исполнитель оставляет за&nbsp;собой право временно приостанавливать работу по&nbsp;техническим или иным причинам. В&nbsp;этом случае, срок действия договора продляется на&nbsp;время вынужденного простоя в&nbsp;работе Исполнителя.<br />
            6.2. Принимая условия Договора Заказчик соглашается с&nbsp;тем, что он&nbsp;не&nbsp;вправе требовать от&nbsp;Исполнителя <span>какой-либо</span> компенсации морального, материального вреда или вреда, причиненного его здоровью как в&nbsp;течение срока действия настоящего Договора, так и&nbsp;по&nbsp;истечении срока его действия, за&nbsp;исключением случаев, прямо предусмотренных действующим законодательством.<br />
            6.3. Информация считается доведенной до&nbsp;сведения Заказчика, если она доступна для ознакомления неограниченному кругу лиц в&nbsp;течении всего рабочего дня Исполнителя (сайт Исполнителя, социальные сети Исполнителя, место оказания услуг Исполнителя, переписка Исполнителя и&nbsp;Заказчика).<br />
            6.4. Все отношения, не&nbsp;урегулированные сторонами в&nbsp;настоящем договоре, регламентируются действующим законодательством Российской Федерации. В&nbsp;случае не&nbsp;достижения Сторонами согласия спор будет передан на&nbsp;рассмотрение в&nbsp;суд общей юрисдикции по&nbsp;подсудности.</p>
          <p>7. ОБСТОЯТЕЛЬСТВА НЕПРЕОДОЛИМОЙ СИЛЫ</p>
          <p>7.1. Стороны освобождаются от&nbsp;ответственности за&nbsp;частичное или полное неисполнение обязательств по&nbsp;настоящему Договору, если это неисполнение явилось следствием обстоятельств непреодолимой силы, возникших после заключения настоящего Договора в&nbsp;результате обстоятельств чрезвычайного характера, таких как: наводнение, пожар, землетрясение и&nbsp;другие природные явления, а&nbsp;также война, военные действия, блокада, запретительные действия властей и&nbsp;акты государственных органов, разрушение коммуникаций и&nbsp;энергоснабжения, взрывы, возникшие во&nbsp;время действия настоящего договора, которые стороны не&nbsp;могли предвидеть или предотвратить.<br />
            7.2. Все споры или разногласия, возникающие между сторонами по&nbsp;настоящему Договору или в&nbsp;связи с&nbsp;ним, разрешаются путем переговоров.<br />
            7.3. В&nbsp;случае исчерпания возможностей для внесудебного урегулирования споров стороны вправе обратится в&nbsp;суд за&nbsp;защитой своих интересов.</p>
          <p>РЕКВИЗИТЫ<br />
            ИСПОЛНИТЕЛЬ:<br />
            Общество с&nbsp;ограниченной ответственностью &laquo;МИССИС ЛЭ&raquo;<br />
            юридический адрес: 127051, г.&nbsp;Москва, ул.&nbsp;Петровка, д. 26, стр.&nbsp;3, эт. 2, пом.4<br />
            ОГРН: 1207700193678, <abbr title="Идентификационный номер налогоплательщика" lang="ru">ИНН</abbr>: 9704018410,<br />
            действующее на&nbsp;основании бессрочной лицензии <span>Л041-01137-77</span>/00327724 от&nbsp;<span>29.12.2020</span>, выдана: Департамент здравоохранения города Москвы (юридический адрес: 109012, Москва, Славянская площадь, д.4, стр.&nbsp;1, телефон +74995780220, эл. почта: <a href="mailto:info@roszdravnadzor.gov.ru">info@roszdravnadzor.gov.ru</a>)<br />
            Банковские реквизиты:<br />
            р\с&nbsp;40702810338000453711<br />
            к\с&nbsp;30101810400000000225<br />
            БИК 044525225<br />
            ПАО Сбербанк Г.&nbsp;МОСКВА<br />
            Адрес электронной почты: <a href="mailto:missislemsk@mail.ru">missislemsk@mail.ru</a><br />
            Адрес сайта: <a href="https://missis-laser.ru/">https://<span>missis-laser</span>.ru/</a><br />
            Телефон: +7 (800) 551 52 57</p>
          <p>Генеральный директор</p>
          <p>__________________/ Батюта Елизавета Сергеевна</p>
        </div>

      </Typography>
    </Box>
  );
};
