import React from 'react';
import { Box, Typography } from '@mui/material';

export const OfferTextBeauty: React.FC = () => {
  return (
    <Box>
      <Typography variant="body1" gutterBottom sx={{ color: 'black' }}>
        <Typography
          variant="h4"
          component="h1"
          gutterBottom
          sx={{
            fontWeight: 'bold',
            fontSize: '20px',
            textAlign: 'center',
            marginBottom: '24px',
          }}
        >
          Договор-оферта на оказание услуг по бронированию даты и времени услуги
        </Typography>
        <p>
          Общество с ограниченной ответственностью &laquo;БЬЮТИ ЭСТЕТИК&raquo; (юридический адрес: 191036, г. Санкт-Петербург, ул. 7-я Советская, д. 9/20, лит. А, пом. 3-Н, ОГРН: 1177847225710,{' '}
          <abbr title="Идентификационный номер налогоплательщика">ИНН</abbr>: 7814696615), действующее на основании бессрочной лицензии{' '}
          <span style={{ whiteSpace: 'nowrap' }}>Л041-01148-78/00348401</span> от <span style={{ whiteSpace: 'nowrap' }}>08.04.2020</span>, выдана: Комитетом по здравоохранению г. Санкт-Петербург (юридический адрес: 191023, г. Санкт-Петербург, ул. Малая Садовая, д. 1, телефон:{' '}
          <span style={{ whiteSpace: 'nowrap' }}>8 (812) 63-555-64</span>, эл. почта:{' '}
          <a href="mailto:kzdrav@gov.spb.ru" style={{ color: 'inherit' }}>
            kzdrav@gov.spb.ru
          </a>
          ), в лице генерального директора Миллер Артемия Александровича, действующего на основании Устава (далее – Исполнитель), адресует настоящий договор-оферта (далее по тексту – Договор) любому физическому лицу (далее – Заказчик), выразившему готовность заключить настоящий Договор на следующих условиях.
        </p>
        <p>
          В соответствии с пунктом 2 ст. 437 Гражданского кодекса РФ, под публичной офертой признается такое предложение, которое содержит все существенные условия договора, а также из которого усматривается воля лица, делающего предложение, заключить такой договор на тех условиях, что приведены в предложении с любым, кто отзовется.
        </p>
        <p>
          Акцептом, <span style={{ whiteSpace: 'nowrap' }}>т.е.</span> принятием условий оферты, признаются действия, связанные с оплатой услуги по бронированию времени в целях получения услуги в Обществе с ограниченной ответственностью &laquo;БЬЮТИ ЭСТЕТИК&raquo; (юридический адрес: 191036, г. Санкт-Петербург, ул. 7-я Советская, д. 9/20, лит. А, пом. 3-Н, ОГРН: 1177847225710, <abbr title="Идентификационный номер налогоплательщика">ИНН</abbr>: 7814696615). Акцепт является полным и безоговорочным. Частичное принятие условий невозможно.
        </p>
        <p>
          <strong>1. ПРЕДМЕТ ДОГОВОРА</strong>
          <br />
          1.1. Предметом настоящего договора-оферты выступает оказание услуги Исполнителя по бронированию даты и времени оказания услуги в Обществе с ограниченной ответственностью &laquo;БЬЮТИ ЭСТЕТИК&raquo; (юридический адрес: 191036, г. Санкт-Петербург, ул. 7-я Советская, д. 9/20, лит. А, пом. 3-Н, ОГРН: 1177847225710, <abbr title="Идентификационный номер налогоплательщика">ИНН</abbr>: 7814696615) (далее – услуга бронирования).
        </p>
        <p>
          1.2. Условия настоящего договора-оферты размещаются в любом общедоступном месте (в месте оказания услуг Исполнителя, в социальных сетях Исполнителя, а также на любых иных ресурсах в сети &laquo;Интернет&raquo;).
        </p>
        <p>
          1.2.1. В целях ознакомления с условиями настоящего договора-оферты и последующего их акцентирования, Исполнитель вправе направить Заказчику настоящий договор-оферту в личные сообщения (мессенджеров/социальных сетей).
        </p>
        <p>
          1.3. Условия настоящего договора-оферты считаются принятыми Заказчиком в результате совершения одного из следующих действий:
          <ul>
            <li>оплатил стоимость услуги бронирования в полном объеме;</li>
            <li>забронировал дату и время оказания услуги у Исполнителя;</li>
            <li>иным, незапрещенным законом способом полностью или частично оплатил услуги Исполнителя.</li>
          </ul>
        </p>
        <p>
          1.4. Стоимость услуги бронирования составляет 50% от стоимости услуги соответствии с прейскурантом, действующим на момент оплаты указанной услуги.
        </p>
        <p>
          1.4.1. По усмотрению Исполнителя стоимость услуги бронирования может быть увеличена до 100% от стоимости услуги соответствии с прейскурантом, действующим на момент оплаты указанной услуги.
        </p>
        <p>
          1.5. Услуга бронирования считается оказанной Заказчику в момент бронирования даты и времени оказания услуги в Обществе с ограниченной ответственностью &laquo;БЬЮТИ ЭСТЕТИК&raquo; (юридический адрес: 191036, г. Санкт-Петербург, ул. 7-я Советская, д. 9/20, лит. А, пом. 3-Н, ОГРН: 1177847225710, ИНН: 7814696615).
        </p>
        <p>
          <strong>2. ПОРЯДОК ОКАЗАНИЯ УСЛУГИ</strong>
          <br />
          2.1. Для получения Услуги бронирования Заказчику необходимо любым удобным способом связаться с Исполнителем и забронировать дату и время оказания услуги посредством ее согласования с Исполнителем.
        </p>
        <p>
          2.2. Заказчик обязан оплатить стоимость услуги бронирования посредством совершения оплаты любым удобным способом по реквизитам Заказчика.
        </p>
        <p>
          2.2.1. Оплата производится Заказчиком в течение 1 (одного) часа с момента согласования даты и времени услуги.
        </p>
        <p>
          2.2.2. В случае неоплаты услуги бронирования в течение времени, указанного в пункте 2.2.1 настоящего договора, дата и время оказания услуги аннулируется.
        </p>
        <p>
          2.3. Заказчик вправе однократно изменить дату и время оказания услуги Исполнителя при соблюдении следующих условий:
        </p>
        <p>
          2.3.1. при оказании услуги Исполнителя изменение даты и времени возможно не позднее, чем за 24 (двадцать четыре) часа до начала забронированной ранее даты и времени оказания услуги Исполнителя.
        </p>
        <p>
          2.4. При несоблюдении условий изменения даты и времени оказания услуги Исполнителя, указанных в пункте 2.3.1, Заказчик лишается права на изменение даты и времени оказания услуги Исполнителя. Стоимость услуги бронирования по настоящему договору пересчету, а равно возврату не подлежит.
        </p>
        <p>
          2.5. В случае явки Заказчика в забронированные дату и время оказания услуги Исполнителя итоговая стоимость услуги Исполнителя уменьшается на стоимость услуги бронирования.
        </p>
        <p>
          <strong>3. ПРИОСТАНОВЛЕНИЕ И ДОСРОЧНОЕ РАСТОРЖЕНИЕ ДОГОВОРА</strong>
          <br />
          3.1. Договор подлежит досрочному расторжению в одностороннем порядке по инициативе Исполнителя в следующих случаях:
          <ul>
            <li>Нарушения Заказчиком условий настоящего Договора.</li>
            <li>Нарушения Заказчиком порядка оплаты услуг.</li>
          </ul>
        </p>
        <p>
          <strong>4. ДОСУДЕБНЫЙ ПОРЯДОК РАССМОТРЕНИЯ СПОРОВ</strong>
          <br />
          4.1. Стороны договорились разрешать все разногласия, связанные с оказанием услуг в рамках настоящего договора, путем предъявления досудебной претензии.
        </p>
        <p>
          4.2. Претензия должна содержать:
          <ul>
            <li>наименование контрагентов (потребитель и исполнитель);</li>
            <li>обстоятельства, являющиеся основанием для предъявления претензии (вред здоровью, оказание некачественной услуги и т.д.);</li>
            <li>указание о предполагаемом способе урегулирования претензии (исполнения обязательств);</li>
            <li>расчет суммы, которую сторона считает обоснованной.</li>
          </ul>
        </p>
        <p>
          4.3. Срок для ответа на претензию составляет 10 (десять) рабочих дней с момента получения.
        </p>
        <p>
          <strong>5. СРОК ДЕЙСТВИЯ ДОГОВОРА</strong>
          <br />
          <strong>5.1.</strong> Договор вступает в силу с момента его заключения и действует до исполнения сторонами обязательств по Договору.
        </p>

        <p>
          <strong>6. ОСОБЫЕ УСЛОВИЯ ДОГОВОРА</strong>
          <br />
          <strong>6.1.</strong> Исполнитель оставляет за собой право временно приостанавливать работу по техническим или иным причинам. В этом случае срок действия договора продляется на время вынужденного простоя в работе Исполнителя.
          <br />
          <strong>6.2.</strong> Принимая условия Договора, Заказчик соглашается с тем, что он не вправе требовать от Исполнителя какой-либо компенсации морального, материального вреда или вреда, причиненного его здоровью, как в течение срока действия настоящего Договора, так и по истечении срока его действия, за исключением случаев, прямо предусмотренных действующим законодательством.
          <br />
          <strong>6.3.</strong> Информация считается доведенной до сведения Заказчика, если она доступна для ознакомления неограниченному кругу лиц в течение всего рабочего дня Исполнителя (сайт Исполнителя, социальные сети Исполнителя, место оказания услуг Исполнителя, переписка Исполнителя и Заказчика).
          <br />
          <strong>6.4.</strong> Все отношения, не урегулированные сторонами в настоящем договоре, регламентируются действующим законодательством Российской Федерации. В случае не достижения Сторонами согласия, спор будет передан на рассмотрение в суд общей юрисдикции по подсудности.
        </p>

        <p>
          <strong>7. ОБСТОЯТЕЛЬСТВА НЕПРЕОДОЛИМОЙ СИЛЫ</strong>
          <br />
          <strong>7.1.</strong> Стороны освобождаются от ответственности за частичное или полное неисполнение обязательств по настоящему Договору, если это неисполнение явилось следствием обстоятельств непреодолимой силы, возникших после заключения настоящего Договора в результате обстоятельств чрезвычайного характера, таких как: наводнение, пожар, землетрясение и другие природные явления, а также война, военные действия, блокада, запретительные действия властей и акты государственных органов, разрушение коммуникаций и энергоснабжения, взрывы, возникшие во время действия настоящего договора, которые стороны не могли предвидеть или предотвратить.
          <br />
          <strong>7.2.</strong> Все споры или разногласия, возникающие между сторонами по настоящему Договору или в связи с ним, разрешаются путем переговоров.
          <br />
          <strong>7.3.</strong> В случае исчерпания возможностей для внесудебного урегулирования споров стороны вправе обратиться в суд за защитой своих интересов.
      </p>

      <p>
        <strong>РЕКВИЗИТЫ</strong>
        <br />
        Исполнитель:
        <br />
        Общество с ограниченной ответственностью «БЬЮТИ ЭСТЕТИК»
        <br />
        юридический адрес: 191036, г. Санкт-Петербург, ул. 7-я Советская, д. 9/20, лит. А, пом. 3-Н; ОГРН: 1177847225710, ИНН: 7814696615,
        <br />
        действующее на основании бессрочной лицензии Л041-01148-78/00348401 от 08.04.2020, выдана: Комитет по здравоохранению г. Санкт-Петербург (юридический адрес: 191023, г. Санкт-Петербург, ул. Малая Садовая, д. 1, телефон: 8 (812) 63-555-64, эл. почта: kzdrav@gov.spb.ru)
        <br />
        Банковские реквизиты:
        <br />
        р/с 40702810238000449977
        <br />
        к/с 30101810400000000225
        <br />
        БИК 044525225
        <br />
        ПАО Сбербанк г. Москва
        <br />
        Адрес электронной почты: info@missis-laser.ru
        <br />
        Адрес сайта: https://missis-laser.ru/
        <br />
        Телефон: +7 (800) 301 93 36
        <br />
        Генеральный директор
        <br />
        __________________/  А.А. Миллер
      </p>
      </Typography>
    </Box >
  );
};
