import React from 'react';
import { Box, Typography, Link } from '@mui/material';

export const OfferTextEsteLazer: React.FC = () => {
  return (
    <Box>
      <Typography variant="body1" gutterBottom sx={{ color: 'black' }}>
        <Typography
          variant="h4"
          component="h1"
          gutterBottom
          sx={{
            fontWeight: 'bold',
            fontSize: '20px',
            textAlign: 'center',
            marginBottom: '24px',
          }}
        >
          Договор-оферта на оказание услуг по бронированию даты и времени услуги
        </Typography>

        <Typography variant="body1" gutterBottom>
          Общество с ограниченной ответственностью &laquo;ЭСТЕ ЛАЗЕР
          КЛИНИК&raquo; (юридический адрес: 420100, Россия, Республика
          Татарстан, г.&nbsp;Казань, проспект Победы, дом 139, корпус 2,
          помещение 1314, ОГРН: 1181690084190,{' '}
          <abbr title="Идентификационный номер налогоплательщика">ИНН</abbr>:
          1660320111), действующее на основании бессрочной лицензии{' '}
          <span style={{ whiteSpace: 'nowrap' }}>Л041-01181-16</span>/00587954
          от <span style={{ whiteSpace: 'nowrap' }}>07.02.2019</span>, выданной
          Федеральной службой по надзору в сфере здравоохранения (юридический
          адрес: 420021, Республика Татарстан, г.&nbsp;Казань,
          ул.&nbsp;Нариманова, д.63, телефон:{' '}
          <span style={{ whiteSpace: 'nowrap' }}>+7(843)292-54-37</span>, эл.
          почта:{' '}
          <Link href="mailto:nfo@reg16.roszdravnadzor.gov.ru">
            nfo@reg16.roszdravnadzor.gov.ru
          </Link>
          ), в лице генерального директора Миллер Артемия Александровича,
          действующего на основании Устава (далее — Исполнитель), адресует
          настоящий договор-оферта любому физическому лицу (далее — Заказчик),
          выразившему готовность заключить настоящий Договор на следующих
          условиях.
        </Typography>

        <Typography variant="body1" gutterBottom>
          В соответствии с пунктом 2 ст. 437 Гражданского кодекса РФ, под
          публичной офертой признается такое предложение, которое содержит все
          существенные условия договора, а также из которого усматривается воля
          лица, делающего предложение, заключить договор на тех условиях,
          которые приведены в предложении, с любым, кто отзовется.
        </Typography>

        <Typography variant="body1" gutterBottom>
          Акцептом, <span style={{ whiteSpace: 'nowrap' }}>т. е.</span>{' '}
          принятием условий оферты, признаются действия, связанные с оплатой
          услуги по бронированию времени в целях получения услуги в Обществе с
          ограниченной ответственностью &laquo;ЭСТЕ ЛАЗЕР КЛИНИК&raquo;
          (юридический адрес: 420100, Россия, Республика Татарстан,
          г.&nbsp;Казань, проспект Победы, дом 139, корпус 2, помещение 1314,
          ОГРН: 1181690084190,{' '}
          <abbr title="Идентификационный номер налогоплательщика">ИНН</abbr>:
          1660320111). Акцепт является полным и безоговорочным. Частичное
          принятие условий невозможно.
        </Typography>

        <strong>1. ПРЕДМЕТ ДОГОВОРА</strong>
        <br />

        <Typography variant="body1" gutterBottom>
          1.1. Предметом настоящего{' '}
          <span style={{ whiteSpace: 'nowrap' }}>договора-оферты</span>{' '}
          выступает оказание услуги Исполнителя по бронированию даты и времени
          оказания услуги в Обществе с ограниченной ответственностью &laquo;ЭСТЕ
          ЛАЗЕР КЛИНИК&raquo; (юридический адрес: 420100, Россия, Республика
          Татарстан, г.&nbsp;Казань, проспект Победы, дом 139, корпус 2,
          помещение 1314, ОГРН: 1181690084190,{' '}
          <abbr title="Идентификационный номер налогоплательщика">ИНН</abbr>:
          1660320111) (далее — услуга бронирования).
        </Typography>

        <Typography variant="body1" gutterBottom>
          1.2. Условия настоящего{' '}
          <span style={{ whiteSpace: 'nowrap' }}>договора-оферты</span>{' '}
          размещаются в любом общедоступном месте (в месте оказания услуг
          Исполнителя, в социальных сетях Исполнителя, а также на любых иных
          ресурсах в сети Интернет).
        </Typography>

        <Typography variant="body1" gutterBottom>
          1.3. Условия настоящего{' '}
          <span style={{ whiteSpace: 'nowrap' }}>договора-оферты</span>{' '}
          считаются принятыми Заказчиком в результате совершения одного из
          следующих действий:
        </Typography>

        <ul>
          <li>оплата стоимости услуги бронирования в полном объеме;</li>
          <li>бронирование даты и времени оказания услуги у Исполнителя;</li>
          <li>
            полная или частичная оплата услуг Исполнителя иным, незапрещённым
            законом, способом.
          </li>
        </ul>

        <Typography variant="body1" gutterBottom>
          1.4. Стоимость услуги бронирования составляет 50% от стоимости услуги
          согласно прейскуранту, действующему на момент оплаты указанной услуги.
        </Typography>

        <Typography variant="body1" gutterBottom>
          1.5. Услуга бронирования считается оказанной Заказчику в момент
          бронирования даты и времени оказания услуги в Обществе с ограниченной
          ответственностью &laquo;ЭСТЕ ЛАЗЕР КЛИНИК&raquo; (юридический адрес:
          420100, Россия, Республика Татарстан, г.&nbsp;Казань, проспект Победы,
          дом 139, корпус 2, помещение 1314, ОГРН: 1181690084190,{' '}
          <abbr title="Идентификационный номер налогоплательщика">ИНН</abbr>:
          1660320111).
        </Typography>

        <p>
          <strong>2. ПОРЯДОК ОКАЗАНИЯ УСЛУГИ</strong>
          <br />
          2.1. Для получения Услуги бронирования Заказчику необходимо любым
          удобным способом связаться с Исполнителем и забронировать дату и время
          оказания услуги.
        </p>

        <p>
          2.2. Заказчик обязан оплатить стоимость услуги бронирования
          посредством совершения оплаты любым удобным способом по реквизитам
          Исполнителя.
        </p>
        <p>
          2.2.1. Оплата производится Заказчиком в течение 1 (одного) часа с
          момента согласования даты и времени услуги.
        </p>
        <p>
          2.2.2. В случае неоплаты услуги бронирования в течение времени,
          указанного в пункте 2.2.1 настоящего договора, дата и время оказания
          услуги аннулируется.
        </p>
        <p>
          2.3. Заказчик вправе однократно изменить дату и время оказания услуги
          Исполнителя при соблюдении следующих условий:
        </p>
        <p>
          2.3.1. При оказании услуги Исполнителя изменение даты и времени
          возможно не позднее, чем за 24 (двадцать четыре) часа до начала
          забронированной ранее даты и времени оказания услуги Исполнителя.
        </p>
        <p>
          2.4. При несоблюдении условий изменения даты и времени оказания
          услуги, указанных в пункте 2.3.1 Заказчик лишается права на изменение
          даты и времени оказания услуги. Стоимость услуги бронирования по
          настоящему договору пересчету, а равно возврату не подлежит.
        </p>
        <p>
          2.5. В случае явки Заказчика в забронированные дату и время оказания
          услуги итоговая стоимость услуги Исполнителя уменьшается на стоимость
          услуги бронирования.
        </p>
        <p>
          <strong>3. ПРИОСТАНОВЛЕНИЕ И ДОСРОЧНОЕ РАСТОРЖЕНИЕ ДОГОВОРА</strong>
          <br />
          3.1. Договор подлежит досрочному расторжению в одностороннем порядке
          по инициативе Исполнителя в следующих случаях:
        </p>
        <ul>
          <li>Нарушения Заказчиком условий настоящего Договора.</li>
          <li>Нарушения Заказчиком порядка оплаты услуг.</li>
        </ul>
        <p>
          <strong>4. ДОСУДЕБНЫЙ ПОРЯДОК РАССМОТРЕНИЯ СПОРОВ</strong>
          <br />
          4.1. Стороны договорились разрешать все разногласия, связанные с
          оказанием услуг в рамках настоящего договора, путем предъявления
          досудебной претензии.
        </p>
        <p>
          Претензия должна содержать:
          <ul>
            <li>наименование контрагентов (потребитель и исполнитель);</li>
            <li>
              обстоятельства, являющиеся основанием для предъявления претензии
              (вред здоровью, оказание некачественной услуги и т. д.);
            </li>
            <li>
              указание о предполагаемом способе урегулирования претензии
              (исполнение обязательств);
            </li>
            <li>
              расчет суммы требований по претензии и реквизиты счета, на который
              должны быть перечислены денежные средства;
            </li>
            <li>
              срок исполнения обязательств контрагентом и/или срок ответа на
              претензию, который не может превышать 10 дней с даты, когда
              обязательство контрагента должно было быть исполнено, если иной
              срок не предусмотрен договором или законодательством Российской
              Федерации;
            </li>
            <li>
              информацию о мерах, которые будут приняты в случае отклонения
              претензии (приостановка исполнения обязательств потерпевшей
              стороной, обращение в суд);
            </li>
            <li>дату и регистрационный номер претензии;</li>
            <li>подпись Заказчиком (уполномоченного лица);</li>
            <li>перечень прилагаемых документов (при наличии).</li>
          </ul>
        </p>
        <p>
          <strong>5. СРОК ДЕЙСТВИЯ ДОГОВОРА</strong>
          <br />
          5.1. Договор вступает в силу с момента его заключения и действует до
          исполнения сторонами обязательств по Договору.
        </p>
        <p>
          <strong>6. ОСОБЫЕ УСЛОВИЯ ДОГОВОРА</strong>
          <br />
          6.1. Исполнитель оставляет за собой право временно приостанавливать
          работу по техническим или иным причинам. В этом случае, срок действия
          договора продляется на время вынужденного простоя в работе
          Исполнителя.
        </p>
        <p>
          6.2. Принимая условия Договора Заказчик соглашается с тем, что он не
          вправе требовать от Исполнителя какой-либо компенсации морального,
          материального вреда или вреда, причиненного его здоровью как в течение
          срока действия настоящего Договора, так и по истечении срока его
          действия, за исключением случаев, прямо предусмотренных действующим
          законодательством.
        </p>
        <p>
          6.3. Информация считается доведенной до сведения Заказчика, если она
          доступна для ознакомления неограниченному кругу лиц в течение всего
          рабочего дня Исполнителя (сайт Исполнителя, социальные сети
          Исполнителя, место оказания услуг Исполнителя, переписка Исполнителя и
          Заказчика).
        </p>
        <p>
          <strong>7. ОБСТОЯТЕЛЬСТВА НЕПРЕОДОЛИМОЙ СИЛЫ</strong>
          <br />
          7.1. Стороны освобождаются от ответственности за частичное или полное
          неисполнение обязательств по настоящему Договору, если это
          неисполнение явилось следствием обстоятельств непреодолимой силы,
          возникших после заключения настоящего Договора в результате
          обстоятельств чрезвычайного характера, таких как: наводнение, пожар,
          землетрясение и другие природные явления, а также война, военные
          действия, блокада, запретительные действия властей и акты
          государственных органов, разрушение коммуникаций и энергоснабжения,
          взрывы, возникшие во время действия настоящего договора, которые
          стороны не могли предвидеть или предотвратить.
        </p>
        <p>
          7.2. Все споры или разногласия, возникающие между сторонами по
          настоящему Договору или в связи с ним, разрешаются путем переговоров.
        </p>
        <p>
          7.3. В случае исчерпания возможностей для внесудебного урегулирования
          споров стороны вправе обратится в суд за защитой своих интересов.
        </p>
        <p>
          <strong>РЕКВИЗИТЫ</strong>
          <br />

          <Typography variant="body1" gutterBottom>
            Общество с ограниченной ответственностью &laquo;ЭСТЕ ЛАЗЕР
            КЛИНИК&raquo;
            <br />
            юридический адрес: 420100, Россия, Республика
            Татарстан, г.&nbsp;Казань, проспект Победы, дом 139, корпус 2,
            помещение 1314,
            <br />
            ОГРН: 1181690084190,
            <br />
            <abbr title="Идентификационный номер налогоплательщика">ИНН</abbr>:
            1660320111
            <br />
            Телефон: +7 (800) 301-93-36
            <br />
            Генеральный директор <br />
            __________________/
            <span style={{ whiteSpace: 'nowrap' }}>А. А. Миллер</span>
          </Typography>
        </p>
      </Typography>
    </Box>
  );
};
